"use client";

import AuthLayout from "@/components/auth/AuthLayout";
import LoginStepsWrapper from "@/components/auth/Login/LoginStepsWrapper";

export default function LoginPage() {
  const captionText = `
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
    چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،
    و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می‌طلبد.
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
    چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،
    و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می‌طلبد.
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است،
    چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،
    و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
    کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می‌طلبد.
    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ.
  `;

  return (
    <AuthLayout
      imageSrc="/images/Authentication/image.JPG"
      imageAlt="عکس"
      caption={captionText}
    >
      <LoginStepsWrapper />
    </AuthLayout>
  );
}
